module.exports = {
    makeNickname : () => {

        let adjectives = ["명예로운","배고픈","빛나는","아름다운","멋진","환상적인","악랄한","검소한","겸손한",
                          "공손한","관대한","근심없는","긍정적인","낙천적인","낭만적인","너그러운","느긋한","다정한","단호한","대담한",
                          "덕망있는","매력적인","명랑한","민첩한","바른","발랄한","부지런한","분별있는","귀여운","사교적인","사랑스런",
                          "사심없는","상냥한","성실한","솔직한","믿음직한","신중한","싹싹한","야망있는","순수한","온순한","용감한","깜찍한",
                          "기특한","고운","고요한","강직한","쾌활한","청초한","정의로운","정직한","자유로운","편안한","포근한","화사한",
                          "화끈한","재밌는","꾸준한","멋진","희망찬","유연한","도전하는","수수한","솔직한","예쁜","섹시한","강렬한","수줍은",
                          "상상하는","소소한"];
        let nouns = ["고래","돌고래","조개","굴","고등어","가리비","성게","고둥","꽃새우","불가사리","각시고둥","멍게","해삼","딱총새우","갯가재",
                    "우렁이","거북손","산호","따개비","담치","홍합","굴","대게","홍게","킹크랩","꽃게","오징어","꼴뚜기","문어","쭈꾸미","돌문어",
                    "꼬마새우","깔깔새우","해파리","끄떡새우","낙지","납작게","납작조개","달랑게","돌조개","은행게","얼룩고둥","밤게","띠조개",
                    "맛조개","민꽃새우","백합","민새우","바지락","꼬막","소라","갑오징어","전복","철갑상어","투구게","스톤피쉬","앵무조개","놀래기",
                    "가오리","펭귄","수달","물범","물개","흰고래","물총고기","닥터피쉬","곰장어","뱀장어","철갑상어","참전복"];
    
        let adjective = adjectives[Math.floor(Math.random() * adjectives.length)];
        let noun = nouns[Math.floor(Math.random() * nouns.length)];


        return `${adjective} ${noun}`;    
    }
}